{
    "Andhra Pradesh": {
        "image": "/public/image/img0.png",
        "detail": "Andhra Pradesh, state of India, located in the southeastern part of the subcontinent. It is bounded by the Indian states of Tamil Nadu to the south, Karnataka to the southwest and west, Telangana to the northwest and north, and Odisha to the northeast. The eastern boundary is a 600-mile (970-km) coastline along the Bay of Bengal. Telangana was a region within Andhra Pradesh for almost six decades, but in 2014 it was carved off to form a separate state. The capital of both Andhra Pradesh and Telangana is Hyderabad, in west-central Telangana.\n\nThe state draws its name from the Andhra people, who have inhabited the area since antiquity and developed their own language, Telugu. Andhra Pradesh came into existence in its present form in 1956 as a result of the demand of the Andhras for a separate state. Although it is primarily agricultural, the state has some mining activity and a significant amount of industry. Area 106,204 square miles (275,068 square km). Pop. (2011) 84,665,533."
    },
    "Arunachal Pradesh": {
        "image": "/public/image/img0.png",
        "detail": "Arunachal Pradesh, state of India. It constitutes a mountainous area in the extreme northeastern part of the country and is bordered by the kingdom of Bhutan to the west, the Tibet Autonomous Region of China to the north, Myanmar (Burma) and the Indian state of Nagaland to the south and southeast, and the Indian state of Assam to the south and southwest. The capital is Itanagar.\n\nArunachal Pradesh, meaning “Land of the Rising Sun,” long has been a recognized region of the Indian subcontinent, receiving mention in such ancient Hindu literature as the Kalika-purana and the epic poems Mahabharata and Ramayana. Formerly known as the North East Frontier Agency (from the British colonial era), the area was part of Assam until it was made the Indian union territory of Arunachal Pradesh in 1972, and in 1987 it became an Indian state. The region, however, has been the subject of an ongoing sovereignty dispute between India and China. Area 32,333 square miles (83,743 square km). Pop. (2011) 1,382,611."
    },
    "Assam": {
        "image": "/public/image/img0.png",
        "detail": "Assam, state of India. It is located in the northeastern part of the country and is bounded to the north by the kingdom of Bhutan and the state of Arunachal Pradesh, to the east by the states of Nagaland and Manipur, to the south by the states of Mizoram and Tripura, and to the west by Bangladesh and the states of Meghalaya and West Bengal. The name Assam is derived from the word asama, meaning “peerless” in the now extinct Ahom language. The neighbouring states of Arunachal Pradesh, Nagaland, Mizoram, and Meghalaya were once part of Assam. The capital, formerly Shillong (now the capital of Meghalaya), was shifted to Dispur, a suburb of Guwahati, in 1972. Area 30,285 square miles (78,438 square km). Pop. (2011) 31,169,272."
    },
    "Bihar": {
        "image": "/public/image/img0.png",
        "detail": "Bihar, state of eastern India. It is bounded by Nepal to the north and by the Indian states of West Bengal to the northeast and Uttar Pradesh to the west. In November 2000 the new state of Jharkhand was created from Bihar’s southern provinces and now forms the state’s southern and southeastern borders. The capital of Bihar is Patna.\n\nBihar occupied an important position in the early history of India. For centuries it was the principal seat of imperial powers and the main focus of Indian culture and civilization. The derivation of the name Bihar from the Sanskrit vihara (Buddhist monastery) reflects the prominence of such communities in the region in ancient times. Area 38,301 square miles (99,200 square km). Pop. (2011) 103,804,637."
    },
    "Chhattisgarh": {
        "image": "/public/image/img0.png",
        "detail": "Chhattisgarh, state of east-central India. It is bounded by the Indian states of Uttar Pradesh and Jharkhand to the north and northeast, Odisha (Orissa) to the east, Telangana (formerly part of Andhra Pradesh) to the south, and Maharashtra and Madhya Pradesh to the west. Its capital is Raipur. Area 52,199 square miles (135,194 square km). Pop. (2011) 25,540,196."
    },
    "Goa": {
        "image": "/public/image/img0.png",
        "detail": "Goa, state of India, comprising a mainland district on the country’s southwestern coast and an offshore island. It is located about 250 miles (400 km) south of Mumbai (Bombay). One of India’s smallest states, it is bounded by the states of Maharashtra on the north and Karnataka on the east and south and by the Arabian Sea on the west. The capital is Panaji (Panjim), on the north-central coast of the mainland district. Formerly a Portuguese possession, it became a part of India in 1962 and attained statehood in 1987. Area 1,429 square miles (3,702 square km). Pop. (2011) 1,457,723."
    },
    "Gujarat": {
        "image": "/public/image/img0.png",
        "detail": "Gujarat, state of India, located on the country’s western coast, on the Arabian Sea. It encompasses the entire Kathiawar Peninsula (Saurashtra) as well as the surrounding area on the mainland. Royal Palace at Jamnagar Royal Palace at Jamnagar\n\nThe state is bounded primarily by Pakistan to the northwest and by the Indian states of Rajasthan to the north, Madhya Pradesh to the east, and Maharashtra to the southeast. Gujarat also shares a small segment of its southeastern border with the Indian union territory of Dadra and Nagar Haveli, and, together with the Arabian Sea, it surrounds the territory of Daman and Diu. The coastline of Gujarat is 992 miles (1,596 km) long, and no part of the state is more than 100 miles (160 km) from the sea. The capital is Gandhinagar, on the outskirts of the north-central city of Ahmadabad (Ahmedabad)—the former capital, the largest city in the state, and one of the most-important textile centres in India. It was in Ahmadabad that Mohandas (Mahatma) Gandhi built his Sabarmati ashram (Sanskrit: ashrama, “retreat” or “hermitage”) as a headquarters for his campaigns against British rule of India.\n\nGujarat draws its name from the Gurjara (supposedly a subtribe of the Huns), who ruled the area during the 8th and 9th centuries CE. The state assumed its present form in 1960, when the former Bombay state was divided between Maharashtra and Gujarat on the basis of language. Area 75,685 square miles (196,024 square km). Pop. (2011) 60,383,628."
    },
    "Haryana": {
        "image": "/public/image/img0.png",
        "detail": "Haryana, state in north-central India. It is bounded on the northwest by the state of Punjab and the union territory of Chandigarh, on the north and northeast by the states of Himachal Pradesh and Uttarakhand, on the east by the state of Uttar Pradesh and the union territory of Delhi, and on the south and southwest by the state of Rajasthan. The city of Chandigarh, within the Chandigarh union territory, serves as the capital of not only that territory but also of the states of Haryana and Punjab.\n\nHaryana was constituted on November 1, 1966, as a result of the partition of the former state of Punjab into two separate states—Punjabi-speaking Punjab and Hindi-speaking Haryana. Although the reorganization followed demands made by the Sikh community for a Punjabi suba (Punjabi-speaking province), it also substantially met the aspirations of people in the Hindi-speaking region of Punjab for a Vishal Haryana (Greater Haryana). The name Haryana, from Hari (the Hindu god Vishnu) and ayana (home), means “The Abode of God.” Area 17,070 square miles (44,212 square km). Pop. (2011) 25,353,081."
    },
    "Himachal Pradesh": {
        "image": "/public/image/img0.png",
        "detail": "Himachal Pradesh, state of India, in the extreme northern part of the Asian subcontinent. It is bounded by Jammu and Kashmir union territory to the northwest and Ladakh union territory to the northeast, by the Tibet Autonomous Region of China to the east, and by the states of Uttarakhand to the southeast, Haryana to the south, and Punjab to the west. Himachal Pradesh occupies a region of scenic splendour in the western Himalayas, offering a multitextured display of lofty snow-clad mountains, deep gorges, thickly forested valleys, large lakes, terraced fields, and cascading streams. Indeed, the name of the state is a reference to its setting: Himachal means “snowy slopes” (Sanskrit: hima, “snow”; acal, “slopes”), and Pradesh means “state.”\n\nThe city of Shimla was the summer headquarters of preindependence British viceroys; it is now the state capital and, at an elevation of about 7,100 feet (2,200 metres), one of the largest and most popular mountain resorts in the country. Formerly a union territory, Himachal Pradesh became a state of India on January 25, 1971. Area 21,495 square miles (55,673 square km). Pop. (2011) 6,856,509."
    },
    "Jharkhand": {
        "image": "/public/image/img0.png",
        "detail": "Jharkhand, state of India, located in the northeastern part of the country. Jharkhand is bordered by the states of Bihar to the north, West Bengal to the east, Odisha to the south, Chhattisgarh to the west, and Uttar Pradesh to the northwest. Its capital is Ranchi.\n\nJharkhand, one of India’s newest states, was carved out of the southern portion of Bihar in 2000. Statehood was the culmination of a long struggle carried on primarily by the Adivasis, or Scheduled Tribes (an official term applied primarily to indigenous communities that fall outside the predominant Indian caste hierarchy). Indian independence brought relatively little socioeconomic benefit to the people of the Jharkhand area, which led to widespread discontent with the Bihar administration, particularly among the tribal peoples. The tribal groups initiated a call for independence from Bihar, and in the 1980s they became militant in their demand. In the 1990s, the separation movement spread to nontribal communities, ultimately precipitating the creation of a new state. Area 28,833 square miles (74,677 square km). Pop. (2011) 32,966,238."
    },
    "Karnataka": {
        "image": "/public/image/img0.png",
        "detail": "Karnataka, formerly (until 1973) Mysore, state of India, located on the western coast of the subcontinent. It is bounded by the states of Goa and Maharashtra to the north, Telangana to the east, Tamil Nadu to the southeast, and Kerala to the south and by the Arabian Sea to the west. The state extends for about 420 miles (675 km) from north to south and for about 300 miles (480 km) from east to west. Its coastline stretches for some 200 miles (320 km). The capital is Bengaluru (Bangalore), near the southeastern border.\n\nBefore the independence of India in 1947, Mysore was a prosperous and progressive but landlocked princely state, with an area of less than 30,000 square miles (78,000 square km), located on the Karnataka Plateau. The transfer of additional territories to the state in 1953 and 1956 united the Kannada-speaking peoples, gave the state an outlet to the sea, and greatly extended its boundaries. The state took its present name, a Kannada word meaning “lofty land,” in 1973. Area 74,051 square miles (191,791 square km). Pop. (2011) 61,130,704."
    },
    "Kerala": {
        "image": "/public/image/img0.png",
        "detail": "Kerala, southwestern coastal state of India. It is a small state, constituting only about 1 percent of the total area of the country. Kerala stretches for about 360 miles (580 km) along the Malabar Coast, varying in width from roughly 20 to 75 miles (30 to 120 km). It is bordered by the states of Karnataka (formerly Mysore) to the north and Tamil Nadu to the east and by the Arabian Sea to the south and west; it also surrounds Mahe, a segment of the state of Puducherry, on the northwestern coast. The capital is Thiruvananthapuram (Trivandrum).\n\nAlthough isolated from the Indian interior by the mountainous belt of the Western Ghats, Kerala has been exposed to many foreign influences via its long coastline; consequently, the state has developed a unique culture within the subcontinent, not only with a diverse religious tradition but also with its own language, Malayalam. Also notable is the high social status that continues to be accorded to women of Kerala, owing to the former strength of a matrilineal kinship system. Area 15,005 square miles (38,863 square km). Pop. (2011) 33,387,677."
    },
    "Madhya Pradesh": {
        "image": "/upload/image/GWALIOR.jpg",
        "detail": "Madhya Pradesh, state of India. As its name implies—madhya means “central” and pradesh means “region” or “state”—it is situated in the heart of the country. The state has no coastline and no international frontier. It is bounded by the states of Uttar Pradesh to the northeast, Chhattisgarh to the southeast, Maharashtra to the south, Gujarat to the southwest, and Rajasthan to the northwest. The capital is Bhopal, in the west-central part of the state. Area 119,016 square miles (308,252 square km). Pop. (2011) 72,597,565."
    },
    "Maharashtra": {
        "image": "/public/image/img0.png",
        "detail": "Maharashtra, state of India, occupying a substantial portion of the Deccan plateau in the western peninsular part of the subcontinent. Its shape roughly resembles a triangle, with the 450-mile (725-km) western coastline forming the base and its interior narrowing to a blunt apex some 500 miles (800 km) to the east. Maharashtra is bounded by the Indian states of Gujarat to the northwest, Madhya Pradesh to the north, Chhattisgarh to the east, Telangana to the southeast, Karnataka to the south, and Goa to the southwest and by the union territory of Dadra and Nagar Haveli and the Arabian Sea to the west.\n\nMaharashtra is a leader among Indian states in terms of agricultural and industrial production, trade and transport, and education. Its ancient culture, at one stage considerably obscured by British dominance, survives largely through the medium of a strong literary heritage. A common literature in Marathi, the predominant language of the state, has in fact played an important role in nurturing a sense of unity among the Maharashtrians. Area 118,800 square miles (307,690 square km). Pop. (2011) 112,372,972."
    },
    "Manipur": {
        "image": "/public/image/img0.png",
        "detail": "Manipur, state of India, located in the northeastern part of the country. It is bordered by the Indian states of Nagaland to the north, Assam to the west, and Mizoram to the southwest and by Myanmar (Burma) to the south and east. Like other northeastern states, it is largely isolated from the rest of India. The name Manipur means “land of gems.” Its economy centres on agriculture and forestry, and trade and cottage industries also are important. The state capital is Imphal, located in the centre of the state. Area 8,621 square miles (22,327 square km). Pop. (2001) 2,293,896; (2011) 2,855,794."
    },
    "Meghalaya": {
        "image": "/public/image/img0.png",
        "detail": "Meghalaya, state of India, located in the northeastern part of the country. It is bounded by the Indian state of Assam to the north and northeast and by Bangladesh to the south and southwest. The state capital is the hill town of Shillong, located in east-central Meghalaya.\n\nMeghalaya—alaya (“abode”) and megha (“of the clouds”)—occupies a mountainous plateau of great scenic beauty. It became a state in 1972. Area 8,660 square miles (22,429 square km). Pop. (2011) 2,964,007."
    },
    "Mizoram": {
        "image": "/public/image/img0.png",
        "detail": "Mizoram, state of India. It is located in the northeastern part of the country and is bounded by Myanmar (Burma) to the east and south and Bangladesh to the west and by the states of Tripura to the northwest, Assam to the north, and Manipur to the northeast. The capital is Aizawl, in the north-central part of the state.\n\nMizoram (“Land of the Mizos”) was known as the Lushai Hills District of Assam before it was renamed the Mizo Hills District in 1954. In 1972 it became a centrally administered union territory under the name of Mizoram, and in 1987 it achieved statehood. Area 8,139 square miles (21,081 square km). Pop. (2011) 1,091,014."
    },
    "Nagaland": {
        "image": "/public/image/img0.png",
        "detail": "Nagaland, state of India, lying in the hills and mountains of the northeastern part of the country. It is one of the smaller states of India. Nagaland is bounded by the Indian states of Arunachal Pradesh to the northeast, Manipur to the south, and Assam to the west and northwest and the country of Myanmar (Burma) to the east. The state capital is Kohima, located in the southern part of Nagaland. Area 6,401 square miles (16,579 square km). Pop (2011) 1,978,502."
    },
    "Odisha": {
        "image": "/public/image/img0.png",
        "detail": "Odisha, formerly called Orissa, state of India. Located in the northeastern part of the country, it is bounded by the states of Jharkhand and West Bengal to the north and northeast, by the Bay of Bengal to the east, and by the states of Andhra Pradesh and Telangana to the south and Chhattisgarh to the west. Before India became independent in 1947, Odisha’s capital was at Cuttack. The present capitol was subsequently built at Bhubaneshwar, in the vicinity of the city’s historic temples in the east-central coastal plains. In late 2011 the state’s name was officially changed from Orissa to Odisha. Area 60,119 square miles (155,707 square km). Pop. (2011) 41,947,358."
    },
    "Punjab": {
        "image": "/public/image/img0.png",
        "detail": "Punjab, state of India, located in the northwestern part of the subcontinent. It is bounded by Jammu and Kashmir union territory to the north, Himachal Pradesh state to the northeast, Haryana state to the south and southeast, and Rajasthan state to the southwest and by the country of Pakistan to the west. Punjab in its present form came into existence on November 1, 1966, when most of its predominantly Hindi-speaking areas were separated to form the new state of Haryana. The city of Chandigarh, within the Chandigarh union territory, is the joint capital of Punjab and Haryana.\n\nThe word Punjab is a compound of two Persian words, panj (“five”) and āb (“water”), thus signifying the land of five waters, or five rivers (the Beas, Chenab, Jhelum, Ravi, and Sutlej). The word’s origin can perhaps be traced to panca nada, Sanskrit for “five rivers” and the name of a region mentioned in the ancient epic the Mahabharata. As applied to the present Indian state of Punjab, however, it is a misnomer: since the partition of India in 1947, only two of those rivers, the Sutlej and the Beas, lie within Punjab’s territory, while the Ravi flows only along part of its western border. Area 19,445 square miles (50,362 square km). Pop. (2011) 27,704,236."
    },
    "Rajasthan": {
        "image": "/public/image/img0.png",
        "detail": "Rajasthan, state of northwestern India, located in the northwestern part of the Indian subcontinent. It is bounded to the north and northeast by the states of Punjab and Haryana, to the east and southeast by the states of Uttar Pradesh and Madhya Pradesh, to the southwest by the state of Gujarat, and to the west and northwest by the provinces of Sindh and Punjab in Pakistan. The capital city is Jaipur, in the east-central part of the state.\n\nRajasthan, meaning “The Abode of the Rajas,” was formerly called Rajputana, “The Country of the Rajputs” (sons of rajas [princes]). Before 1947, when India achieved independence from British rule, it comprised some two dozen princely states and chiefships, the small British-administered province of Ajmer-Merwara, and a few pockets of territory outside the main boundaries. After 1947 the princely states and chiefships were integrated into India in stages, and the state took the name Rajasthan. It assumed its present form on November 1, 1956, when the States Reorganization Act came into force. Area 132,139 square miles (342,239 square km). Pop. (2011) 68,621,012."
    },
    "Sikkim": {
        "image": "/public/image/img0.png",
        "detail": "Sikkim, state of India, located in the northeastern part of the country, in the eastern Himalayas. It is one of the smallest states in India. Sikkim is bordered by the Tibet Autonomous Region of China to the north and northeast, by Bhutan to the southeast, by the Indian state of West Bengal to the south, and by Nepal to the west. The capital is Gangtok, in the southeastern part of the state.\n\nLong a sovereign political entity, Sikkim became a protectorate of India in 1950 and an Indian state in 1975. Its small size notwithstanding, Sikkim is of great political and strategic importance for India because of its location along several international boundaries. Area 2,740 square miles (7,096 square km). Pop. (2011) 607,688."
    },
    "Tamil Nadu": {
        "image": "/public/image/img0.png",
        "detail": "Tamil Nadu, state of India, located in the extreme south of the subcontinent. It is bounded by the Indian Ocean to the east and south and by the states of Kerala to the west, Karnataka (formerly Mysore) to the northwest, and Andhra Pradesh to the north. Enclosed by Tamil Nadu along the north-central coast are the enclaves of Puducherry and Karaikal, both of which are part of Puducherry union territory. The capital is Chennai (Madras), on the coast in the northeastern portion of the state.\n\nTamil Nadu represents the Tamil-speaking area of what was formerly the Madras Presidency of British India. The Tamils are especially proud of their Dravidian language and culture, and they have notably resisted attempts by the central government to make Hindi (an Indo-Aryan language) the sole national language. While it has an industrial core in Chennai, the state is essentially agricultural. Area 50,216 square miles (130,058 square km). Pop. (2011) 72,138,958."
    },
    "Telangana": {
        "image": "/public/image/img0.png",
        "detail": "Telangana, also spelled Telengana or Telingana, constituent state of south-central India. It is bordered by the states of Maharashtra to the north, Chhattisgarh and Odisha to the northeast, Andhra Pradesh to the southeast and south, and Karnataka to the west. The area of what is now Telangana constituted the north-central and northeastern portions of Andhra Pradesh for almost six decades, but on June 2, 2014, that territory was calved off to form a separate state. The capital of both Telangana and Andhra Pradesh is Hyderabad, in west-central Telangana."
    },
    "Tripura": {
        "image": "/public/image/img0.png",
        "detail": "Tripura, state of India. It is located in the northeastern part of the subcontinent. It is bordered to the north, west, and south by Bangladesh, to the east by the state of Mizoram, and to the northeast by the state of Assam. It is among the smallest of India’s states and is located in an isolated hilly region of the country, with various indigenous peoples—or tribes—accounting for a significant portion of the population. The capital is Agartala, near the Bangladesh border in the northwestern part of the state. Area 4,049 square miles (10,486 square km). Pop. (2011) 3,671,032."
    },
    "Uttarakhand": {
        "image": "/public/image/img0.png",
        "detail": "Uttarakhand, formerly Uttaranchal, state of India, located in the northwestern part of the country. It is bordered to the northwest by the Indian state of Himachal Pradesh, to the northeast by the Tibet Autonomous Region of China, to the southeast by Nepal, and to the south and southwest by the Indian state of Uttar Pradesh. Its capital is the northwestern city of Dehra Dun.\n\nOn November 9, 2000, the state of Uttaranchal—the 27th state of India—was carved out of Uttar Pradesh, and in January 2007 the new state changed its name to Uttarakhand, meaning “northern region,” which was the traditional name for the area. Area 19,739 square miles (51,125 square km). Pop. (2011) 10,116,752."
    },
    "Uttar Pradesh": {
        "image": "/public/image/img0.png",
        "detail": "Uttar Pradesh, the most populous and fourth largest state of India. It lies in the north-central part of the country.\n\nUttar Pradesh is bordered by the state of Uttarakhand and the country of Nepal to the north, the state of Bihar to the east, the states of Jharkhand and Chhattisgarh to the southeast, the state of Madhya Pradesh to the south, and the states of Rajasthan and Haryana and the national capital territory of Delhi to the west. On January 26, 1950, when India became a republic, the state was given its present name, Uttar Pradesh (literally, “Northern State”). Its capital is Lucknow, in the west-central part of the state. Area 93,933 square miles (243,286 square km). Pop. (2011) 199,581,477."
    },
    "West Bengal" : {
        "image": "/public/image/img0.png",
        "detail": "West Bengal, state of India, located in the eastern part of the country. It is bounded to the north by the state of Sikkim and the country of Bhutan, to the northeast by the state of Assam, to the east by the country of Bangladesh, to the south by the Bay of Bengal, to the southwest by the state of Odisha, to the west by the states of Jharkhand and Bihar, and to the northwest by the country of Nepal.\n\nWest Bengal has a peculiar configuration; its breadth varies from 200 miles (320 km) at one point to hardly 10 miles (16 km) at another. Its roughly 1,350-mile (2,200-km) frontier with Bangladesh, neither natural nor well defined, is of strategic importance. Although in area West Bengal ranks as one of the smaller states of India, it is one of the largest in population. The capital is Kolkata (Calcutta). Area 34,267 square miles (88,752 square km). Pop. (2011) 91,347,736."
    }
}